# Задача 1. Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран

c=0
a=1
while a<101:
    c+=a
    a+=1
print(c)

# Задача 2. Посчитать сумму числового ряда от 0 до 14 включительно.

c=0
a=1
while a<=14:
    c+=a
    a+=1
print(c)

# Задача 2 advanced. Посчитать сумму числового ряда от 0 до n включительно. n задается пользователем.

a=1
c=0
e=int(input('Введите число до которого нужно сложить: '))
while a<=e:
    c+=a
    a+=1
print(c)

# Задача 3. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
while True:
    a=input('Введите математическую оперцию в формате "1 / 55",а если хотите закончить "0": ')
    if a=='0':
        break
    b = a.split(' ')
    a=int(b[0])
    c=int(b[2])
    if b[1]=='+':
        print(a+c)
    elif b[1]=='-':
        print(a-c)
    elif b[1]=='*':
        print(a*c)
    elif b[1]=='/':
        if c==0:
            print('На "0" делить нельзя. Введите данные заново')
        else:
            print(a/c)
    else:
        print('Знак оперции неверный. Может быть: "+,-,*,/": ')

